// 通用数据文件
const commonData = {
    // 警告框数据
    warningInfo: {
        warningText: "******非拉勿偷，偷必删+全网拉黑******",
        noticeItems: [
            "1. 进群新人请先改昵称为 🆔+游戏昵称，例：🆔小红狐。",
            "2. 新增删除请@小红狐。",
            "3. 如果好友许久未通过，请在群内@对应昵称的农场主。",
            "4. 群人数超495触发【随机刀人】机制。",
            "5. 随机刀人规则：无🆔，不活跃，无贡献。",
            "6. 群内交易须批准，每月50RMB摊位费，摊位费将赠予贡献榜前五。",
            "7. 当前摊位费余额：0 RMB"
        ]
    },
    
    // 月度最佳温泉贡献奖励内容
    updates: [
        { content: "获奖者从以下内容中任选一项：" },
        { content: "A.两次初心号吞吞（根据当前奖励号主等级）" },
        { content: "B.包周初心号（周内经验，周末金币）" },
        { content: "C.包周80-90级号*2（周内经验，周末金币）" },
    ],
    
    // 月度最佳温泉贡献奖励规则
    rules: [
        { content: "1. 每月评选一次，评选时间为每月1-5日" },
        { content: "2. 评选方式：动态积分制" },
        { content: "3. 评选标准：温泉贡献度、商人贡献度、活跃系数" },
        { content: "4. 禁止刷屏、恶意灌水等行为" },
        { content: "5. 获奖者需在群内公示3天" },
        { content: "6. 如有违规行为，取消当月评选资格" },
        { content: "7. 详细规则如下：" },
        { content: "8. 温泉贡献分：动物加工5分，扩容4分，鱼卡4分，作物丰收3，拿取2，其余1分" },
        { content: "9. 商人贡献分：商人出现等级*3*1%（例樱花：94*3*1%=2.82）" },
        { content: "10. 每周一接龙时需在后面后缀@群内昵称，以便积分添加，无群内昵称视为放弃积分" },
        { content: "11. 群昵称与接龙号昵称一致则无需添加" },
        { content: "12. 活跃系数：1-5分，1-5号统计上月聊天数量，依次赋分" }
    ]
}; 