// 玩家数据文件
const playerData = {
    // 玩家数据
    commonSection: [
        {
            title: "加工动物产品获得农场经验提升+24%",
            players: [
                {id: "幼鱼v", uid: "879857542", note: ""},
                {id: "黎幕落", uid: "809913956", note: "@美味胡豆"},
                {id: "温情rL", uid: "1855015052", note: "@抱住玉"},
                {id: "翻天小爸", uid: "629566914", note: ""},
                {id: "兰若吟旧梦", uid: "1671532011", note: ""},
                {id: "青烟睡不醒", uid: "1723062653", note: "@超级酷的知沂"},
                {id: "夏至zzz野", uid: "1977956290", note: ""},
                {id: "别装聋作哑", uid: "1491927704", note: "@春雪后"},
                {id: "点听星火", uid: "611352058", note: ""},

            ]
        }, {
            title: "加工器容量提升+40%",
            players: [
                {id: "嵊囡", uid: "1672551696", note: "@美味胡豆"},
                {id: "書中心", uid: "1133256138", note: ""},
            ]
        },
        {
            title: "钓鱼&鱼卡熟练度+60%",
            players: [
                {id: "BB来噜", uid: "693610369", note: ""},
                {id: "不吃香菜oo_", uid: "927613052", note: ""},
                {id: "糖糖ProMax", uid: "53428195", note: ""},
                {id: "炒乌龙", uid: "1275803273", note: ""},
                {id: "Yao_冬", uid: "1672593855", note: ""},
                {id: "泛清波摘遍", uid: "1986397236", note: ""},
            ]
        },
        {
            title: "农场丰收概率 【大】",
            players: [
                {id: "柠檬爱汤圆", uid: "598717627", note: ""},
                {id: "宠BB", uid: "1636074284", note: ""},
                {id: "是小夭哇", uid: "1522764861", note: ""},
                {id: "不吃豆蕨子", uid: "1780211070", note: ""},
                {id: "黒玫", uid: "461685749", note: ""},
                {id: "Sunshine汤圆", uid: "1168124708", note: ""},
            ]
        },{
            title: "每日拿取次数+15",
            players: [
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
            ]
        },

    ],
    // 经验区数据
    experienceSection: [
        {
            title: "加工作物产品获得农场经验提升+30%",
            players: [
                {id: "07糕冷小妈", uid: "568607054", note: ""},
                {id: "海", uid: "207926288", note: ""},
                {id: "丁丁又喂饼了", uid: "296554445", note: ""},
                {id: "6PJd", uid: "814120697", note: ""},
                {id: "柒一桉", uid: "1814438771", note: ""},
            ]
        },
        {
            title: "收获作物时农场经验获取提升+8%",
            players: [
                {id: "星梦花花", uid: "1721391366", note: ""},
                {id: "Su淼淼是只喵", uid: "1882664727", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
            ]
        },
        {
            title: "收获动物时农场经验获取提升+6%",
            players: [
                {id: "3号是狼呀快跑", uid: "1043306348", note: ""},
                {id: "你说话小点声", uid: "42396853", note: "@糖糖ProMax"},
                {id: "美味胡豆", uid: "1237393400", note: ""},
                {id: "勿咽", uid: "1425801416", note: "@洗白"},
                {id: "妮稱", uid: "1217686835", note: ""},
                {id: "螺蛳粉味鸡腿", uid: "1713197583", note: "@可可夹心芝士"},
                {id: "啊啊啊啊啊pan", uid: "1754205720", note: ""},
                {id: "归期li", uid: "693864919", note: "@久玥"},
                {id: "与卿来噜", uid: "1993522363", note: "@宠BB"},
            ]
        },
        {
            title: "鱼塘全水层钓鱼经验+15%",
            players: [
                {id: "长夏奇吖", uid: "1555174917", note: "@久玥"},
                {id: "君禧绾之h", uid: "1063826097", note: ""},
                {id: "不要不开心噢7", uid: "1773729343", note: ""},
                {id: "传闻中的小茹", uid: "169463462", note: ""},
                {id: "深海", uid: "1360929314", note: ""},
                {id: "勿cc", uid: "1104998680", note: "@宠BB"},
            ]
        }
    ],

    // 熟练度区数据
    skillSection: [
        {
            title: "作物熟练度获取提升+40%",
            players: [
                {id: "窈窈", uid: "1161014933", note: ""},
                {id: "二粒糖糖", uid: "428518580", note: "@糖糖ProMax"},
                {id: "小偮", uid: "", note: "@小迷弟"},
                {id: "Sugarkitty", uid: "848114432", note: ""},
                {id: "阿詁", uid: "88861711", note: "@阿匝"},
                {id: "肉丸子你吃不", uid: "1854144637", note: ""},
            ]
        },
        {
            title: "动物熟练度获取提升+40%",
            players: [
                {id: "抱住玉", uid: "177925221", note: "@筱筱ui"},
                {id: "me", uid: "185246080", note: ""},
                {id: "萌小只", uid: "1773644104", note: "@雪萌萌"},
                {id: "赫玛亚的温风", uid: "1354944862", note: ""},
                {id: "Shirley汤汤", uid: "134429049", note: ""},
            ]
        }
    ],

    // 金币区数据
    coinSection: [

        {
            title: "水族箱效率提升+45%",
            players: [
                {id: "亓影l", uid: "406650259", note: ""},
                {id: "第一真心人", uid: "669676586", note: ""},
                {id: "时方悟", uid: "1671549138", note: ""},
                {id: "仪笙", uid: "", note: ""},
            ]
        },
        {
            title: "鱼饵价格降低+15%",
            players: [
                 {id: "芙⼉", uid: "1362694097", note: ""},
                 {id: "我要揪你耳朵咯", uid: "1977923052", note: "@可可夹心芝士"},
                 {id: "地拿大王", uid: "1343458129", note: ""},
            ]
        },
        {
            title: "动物丰收概率提升 【大】",
            players: [
                {id: "赶脚儿", uid: "24259014", note: ""},
                {id: "柠萌不恬oO", uid: "1087893230", note: ""},
                {id: "香港小市民", uid: "1366280742", note: "@杨的梦"},
                {id: "杨七柒", uid: "1168096522", note: ""},
            ]
        }
    ],

    // 耻辱柱数据
    shamePlayers: [
        {id: "待我腋毛齐腰", uid: ":117110522", note: "潜水、无贡献、无视群公告"},
        {id: "小梨宝baby", uid: ":5861737", note: "偷菜、炸鱼、乱祈福"},
        {id: "表情包的包", uid: "886993458", note: "偷菜、无贡献、潜水"},
        {id: "岛cpr", uid: "1314138596", note: "偷菜、无贡献、潜水"},
        {id: "易疯i", uid: "1346741598", note: "无贡献、无视群公告"}
    ]
}; 