// 玩家数据文件
const playerData = {
    // 玩家数据
    commonSection: [
        {
            title: "加工动物产品获得农场经验提升+24%",
            players: [
                {id: "曲奇怮", uid: "1293697994", note: ""},
                {id: "蔡蔡种菜四号", uid: "28825833", note: "@紵悅"},
                {id: "杨七柒", uid: "1168096522", note: ""},
                {id: "2号是狼呀快跑", uid: "896845314", note: "@3号是狼呀快跑"},
            ]
        }, {
            title: "加工器容量提升+40%",
            players: [
                {id: "圣地", uid: "896684837", note: ""},
                {id: "小胖斧z", uid: "1778930279", note: "无需@"},
                {id: "脆脆脆桃子", uid: "800118851", note: ""},
                {id: "月亮睡不醒Kd", uid: "45005980", note: "@马铃薯公主i"},
                {id: "二百是只瘸猫", uid: "1948137127", note: ""},
                {id: "喵喵喵哥哥怕怕", uid: "776027472", note: ""},
                {id: "小镇荣七里香", uid: "1341751364", note: ""},
                {id: "故里梦溪", uid: "1986563220", note: ""},
                {id: "王哪哪哪泽", uid: "1281074839", note: ""},
            ]
        },
        {
            title: "钓鱼&鱼卡熟练度+60%",
            players: [
                {id: "傲娇玥", uid: "1209883127", note: ""},
                {id: "蔡蔡种菜0", uid: "1272041458", note: "@紵悅"},
                {id: "萌妹", uid: "207926288", note: "无需@"},
                {id: "萌小只", uid: "1773644104", note: "@雪萌萌"},
                {id: "小梨宝baby", uid: "5861737", note: ""},
                {id: "二余温道", uid: "1334943603", note: ""},
                {id: "随和空旅行者", uid: "1261215073", note: "@白芝麻滚铁球"},
            ]
        },
        {
            title: "农场丰收概率 【大】",
            players: [
                {id: "小雪LLL", uid: "1429665992", note: ""},
                {id: "暖成真羊驼", uid: "914098542", note: "@5bz"},
                {id: "玥玥小5", uid: "1043929598", note: "@PureLovekk"},
            ]
        },{
            title: "每日拿取次数+15",
            players: [
                {id: "暂无", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
            ]
        },

    ],
    // 经验区数据
    experienceSection: [
        {
            title: "加工作物产品获得农场经验提升+30%",
            players: [
                {id: "暂无", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
            ]
        },
        {
            title: "收获作物时农场经验获取提升+8%",
            players: [
                {id: "好奇了吗", uid: "522348200", note: ""},
                {id: "宅妹玉", uid: "389773493", note: ""},
                {id: "久居香菜林", uid: "207339958", note: "@不要不开心噢7"},
                {id: "朝歌To", uid: "714629115", note: "@3号是狼呀快跑"},
                {id: "超级酷的知沂", uid: "1053835152", note: ""},
                {id: "旧谨", uid: "1371978722", note: ""},
            ]
        },
        {
            title: "收获动物时农场经验获取提升+6%",
            players: [
                {id: "淡墨染锦衣", uid: "22035724", note: ""},
            ]
        },
        {
            title: "鱼塘全水层钓鱼经验+15%",
            players: [
                {id: "在看月亮吗", uid: "472621821", note: ""},
                {id: "奻諵", uid: "927548889", note: ""},
                {id: "BB来噜", uid: "693610369", note: ""},
            ]
        }
    ],

    // 熟练度区数据
    skillSection: [
        {
            title: "作物熟练度获取提升+40%",
            players: [
                {id: "薄雾插画烧仙草", uid: "1806991113", note: ""},
                {id: "长夏奇吖", uid: "1555174917", note: "@久玥"},
                {id: "睿祺呢", uid: "942674319", note: ""},
                {id: "苿熙", uid: "948621231", note: ""},
                {id: "嘟嘟指挥官", uid: "864382941", note: ""},
                {id: "糖糖ProMax", uid: "53428195", note: ""},
            ]
        },
        {
            title: "动物熟练度获取提升+40%",
            players: [
                {id: "夏日菠萝啤", uid: "735005786", note: "@沾砚"},
                {id: "纱猫讥笑", uid: "1131453789", note: "@6PJd"},
                {id: "螺蛳粉味鸡腿", uid: "1713197583", note: "@可可夹心芝士"},
                {id: "芋泥小甜狗m", uid: "1368951537", note: ""},
                {id: "炒乌龙", uid: "1275803273", note: ""},
                {id: "别装聋作哑", uid: "1491927704", note: ""},
            ]
        }
    ],

    // 金币区数据
    coinSection: [

        {
            title: "水族箱效率提升+45%",
            players: [
                {id: "一点已松子糖", uid: "1909616923", note: ""},
                {id: "我是不讲李", uid: "395996428", note: ""},
                {id: "跑快快吃饭饭", uid: "918460768", note: "@喵喵喵哥哥怕怕"},
                {id: "净", uid: "862495046", note: ""},
            ]
        },
        {
            title: "鱼饵价格降低+15%",
            players: [
                {id: "优雅的水晶晚風", uid: "1541520250", note: ""},
                {id: "Sunshine汤圆", uid: "1168124708", note: ""},
                {id: "七载若木", uid: "1682115750", note: ""},
                {id: "女乃_米唐", uid: "322908505", note: ""},
                {id: "3号是狼呀快跑", uid: "1043306348", note: ""},
                {id: "暮年o", uid: "1555153559", note: "@久玥"},
                {id: "Xyqz7", uid: "1298690877", note: "@不要不开心噢7"},
            ]
        },
        {
            title: "动物丰收概率提升 【大】",
            players: [
                {id: "拿瓶伏特加", uid: "220255291", note: ""},
                {id: "第六只燕子", uid: "239054096", note: "@充甜宝"},
                {id: "玫瑰生煎包", uid: "962828760", note: ""},
                {id: "6PJd", uid: "814120697", note: ""},
                {id: "别惹如意", uid: "336553105", note: ""},
            ]
        }
    ],

    // 耻辱柱数据
    shamePlayers: [
        {id: "表情包的包", uid: "886993458", note: "偷菜、无贡献、潜水"},
        {id: "岛cpr", uid: "1314138596", note: "偷菜、无贡献、潜水"},
        {id: "易疯i", uid: "1346741598", note: "无贡献、无视群公告"}
    ]
}; 