// 玩家数据文件
const playerData = {
    // 玩家数据
    commonSection: [
        {
            title: "加工动物产品获得农场经验提升+24%",
            players: [
                {id: "赶脚儿", uid: "24259014", note: ""},
                {id: "求求别偷我菜啊", uid: "519237579", note: ""},
                {id: "妮稱", uid: "1217686835", note: ""},
                {id: "艾薇er", uid: "000", note: ""},
                {id: "噼里啪啦_Lx", uid: "1887564564", note: ""},

            ]
        }, {
            title: "加工器容量提升+40%",
            players: [
                {id: "火星人哔哔哔", uid: "41735180", note: ""},
                {id: "豆哥子豆", uid: "522385819", note: ""},
                {id: "春雪后", uid: "1329040623", note: ""},
                {id: "000", uid: "000", note: ""},
            ]
        },
        {
            title: "钓鱼&鱼卡熟练度+60%",
            players: [
                {id: "打的你变猪头", uid: "1142182629", note: ""},
                {id: "螺蛳粉味鸡腿", uid: "1713197583", note: "@可可夹心芝士"},
                {id: "泠泠雪诗", uid: "1162359080", note: ""},
                {id: "爱吃无穷鸡腿", uid: "1083757627", note: ""},
                {id: "半月魔女", uid: "1587239987", note: ""},
            ]
        },
        {
            title: "农场丰收概率 【大】",
            players: [
                {id: "晨光熹微YL", uid: "791291738", note: "@Luckyd8k"},
                {id: "xxxy823", uid: "225091501", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
            ]
        },{
            title: "每日拿取次数+15",
            players: [
                {id: "Lyricist", uid: "542107485", note: "@春雪后"},
                {id: "炒乌龙", uid: "1275803273", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
            ]
        },

    ],
    // 经验区数据
    experienceSection: [
        {
            title: "加工作物产品获得农场经验提升+30%",
            players: [
                {id: "超爱麻薯小卷", uid: "59354637", note: "@姚小白丨"},
                {id: "油癫猫饼", uid: "1977999648", note: ""},
                {id: "爱吃猫条的猫猫", uid: "1272173363", note: ""},
                {id: "丁丁又喂饼了", uid: "296554445", note: ""},
                {id: "是谁在被爱", uid: "630029268", note: ""},
                {id: "酱酱不吃姜yu", uid: "1723090632", note: ""},
            ]
        },
        {
            title: "收获作物时农场经验获取提升+8%",
            players: [
                {id: "与卿来噜", uid: "1993522363", note: ""},
                {id: "每天只会吨吨吨", uid: "1968001969", note: ""},
                {id: "时方悟", uid: "1671549138", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
            ]
        },
        {
            title: "收获动物时农场经验获取提升+6%",
            players: [
                {id: "午后真香秘境", uid: "1339766606", note: "@6PJd"},
                {id: "i乌龙茶", uid: "1247700275", note: "@雪萌萌"},
                {id: "为你核移植", uid: "525677259", note: "@你我如星月"},
                {id: "洗⽩", uid: "000", note: ""},
            ]
        },
        {
            title: "鱼塘全水层钓鱼经验+15%",
            players: [
                {id: "嘿MHX", uid: "1669205998", note: "@龙龙"},
                {id: "极品靑年", uid: "595513440", note: ""},
                {id: "格子外的星空", uid: "1283643990", note: ""},
                {id: "睡不着的cat", uid: "1466960183", note: ""},
                {id: "可乐饼小鱼仔", uid: "1642118988", note: ""},
            ]
        }
    ],

    // 熟练度区数据
    skillSection: [
        {
            title: "作物熟练度获取提升+40%",
            players: [
                {id: "深情in棒棒糖", uid: "640491996", note: "@半颜吖"},
                {id: "小脑菜菜", uid: "982616931", note: ""},
                {id: "君禧绾之h", uid: "1063826097", note: ""},
                {id: "辣妹妹", uid: "1156480107", note: "@特甜辣妹"},
                {id: "Sunshine汤圆", uid: "1168124708", note: "@Sunshine汤圆"},
            ]
        },
        {
            title: "动物熟练度获取提升+40%",
            players: [
                {id: "苿熙", uid: "948621231", note: ""},
                {id: "綿喵", uid: "1826491880", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
            ]
        }
    ],

    // 金币区数据
    coinSection: [

        {
            title: "水族箱效率提升+45%",
            players: [
                {id: "喵喵喵哥哥怕怕", uid: "776027472", note: ""},
                {id: "在看月亮吗", uid: "472621821", note: ""},
                {id: "000", uid: "000", note: ""},
                {id: "000", uid: "000", note: ""},
            ]
        },
        {
            title: "鱼饵价格降低+15%",
            players: [
                {id: "长夏奇吖", uid: "1555174917", note: "@久玥"},
                {id: "像素再见源泉", uid: "1185383571", note: ""},
                {id: "来看月亮嘛", uid: "499862513", note: "@在看月亮吗"},
                {id: "柒一桉", uid: "1814438771", note: ""},
                {id: "小胖斧z", uid: "1778930279", note: ""},
            ]
        },
        {
            title: "动物丰收概率提升 【大】",
            players: [
                {id: "宅妹玉", uid: "389773493", note: ""},
                {id: "杭州彦祖", uid: "610653638", note: ""},
                {id: "月亮睡不醒Kd", uid: "45005980", note: "@马铃薯公主i"},
                {id: "000", uid: "000", note: ""},
            ]
        }
    ],

    // 耻辱柱数据
    shamePlayers: [
        {id: "待我腋毛齐腰", uid: ":117110522", note: "潜水、无贡献、无视群公告"},
        {id: "小梨宝baby", uid: ":5861737", note: "偷菜、炸鱼、乱祈福"},
        {id: "表情包的包", uid: "886993458", note: "偷菜、无贡献、潜水"},
        {id: "岛cpr", uid: "1314138596", note: "偷菜、无贡献、潜水"},
        {id: "易疯i", uid: "1346741598", note: "无贡献、无视群公告"}
    ]
}; 