// 玩家数据文件
const playerData = {
    // 玩家数据
    commonSection: [
        {
            title: "加工动物产品获得农场经验提升+24%",
            players: [
                {id: "姈钰", uid: "1374870284", note:"",at: ""},
                {id: "美女不讲道理", uid: "185232831", note:"",at: ""},
                {id: "姚小白丨", uid: "1818764023", note:"",at: ""},
                {id: "点观星火", uid: "1822431691", note:"",at: "@点听星火"},
             ]
        }, {
            title: "加工器容量提升+40%",
            players: [
                {id: "酱酱不吃姜yu", uid: "1723090632", note:"",at: ""},
                {id: "糊椒蛮馋h", uid: "1518506048", note:"",at: "@卜渴梨鱼y"},
                {id: "宁小巧红豆沙", uid: "", note:"",at: "@柠萌不萌"},
                {id: "每天只会吨吨吨", uid: "1968001969", note:"",at: ""},
                {id: "奶楹", uid: "", note:"",at: ""},
                {id: "嘿", uid: "", note:"",at: "@龙龙"},
            ]
        },
        {
            title: "钓鱼&鱼卡熟练度+60%",
            players: [
                {id: "6PJd", uid: "814120697", note:"",at: ""},
                {id: "蔡蔡种菜一号", uid: "956586496", note:"",at: "@紵悅"},
                {id: "l九转大肠l", uid: "395862460", note:"",at: ""},
                {id: "肉丸子你吃不", uid: "1854144637", note:"",at: ""},
                {id: "问亚利", uid: "1888547460", note:"",at: ""},
                {id: "⽤⼾", uid: "1837236375", note:"",at: "@高甜"},
            ]
        },
        {
            title: "农场丰收概率 【大】",
            players: [
                {id: "晨光熹微YL", uid: "791291738", note:"",at: "@柠萌不萌"},
                {id: "但是f", uid: "540105349", note:"",at: "@沾砚"},
                {id: "星梦小小花花", uid: "1911186327", note:"",at: ""},
                {id: "Soul青柠", uid: "53473178", note:"",at: ""},
                {id: "萌小只", uid: "1773644104", note:"",at: "@雪萌萌"},
            ]
        },

    ],
    // 经验区数据
    experienceSection: [
        {
            title: "加工作物产品获得农场经验提升+30%",
            players: [
                {id: "卜渴梨鱼y", uid: "1518505952", note:"",at: ""},
            ]
        },
        {
            title: "收获作物时农场经验获取提升+8%",
            players: [
                {id: "i乌龙茶", uid: "1247700275", note:"",at: "@雪萌萌"},
                {id: "芙儿", uid: "1362694097", note:"",at: "@芙儿"},
                {id: "超甜呢", uid: "272086094", note:"",at: ""},
                {id: "喵喵o6", uid: "1298560133", note:"",at: "@柠萌不萌"},
            ]
        },
        {
            title: "收获动物时农场经验获取提升+6%",
            players: [
                {id: "Z寒酥", uid: "1084545448", note:"",at: "@姚小白"},
            ]
        },
        {
            title: "鱼塘全水层钓鱼经验+15%",
            players: [
                {id: "空巴瓦", uid: "696678798", note:"",at: ""},
                {id: "沾砚", uid: "713365822", note:"",at: ""},
            ]
        }
    ],

    // 熟练度区数据
    skillSection: [
        {
            title: "作物熟练度获取提升+40%",
            players: [
                {id: "XXXYy", uid: "904745578", note:"",at: ""},
                {id: "雪无Zzz", uid: "18800218", note:"",at: ""},
            ]
        },
        {
            title: "动物熟练度获取提升+40%",
            players: [
                {id: "幼稚zh", uid: "734545664", note:"",at: ""},
                {id: "小短腿5n", uid: "611344402", note:"",at: ""},
                {id: "蔡蔡种菜四号", uid: "28825833", note:"",at: "@紵悅"},
                {id: "小朋友559", uid: "886946117", note:"",at: ""},
                {id: "雪萌萌", uid: "541063286", note:"",at: ""},
                {id: "一百瓦电灯泡", uid: "1642453335", note:"",at: "@高甜"},
            ]
        }
    ],

    // 金币区数据
    coinSection: [

        {
            title: "水族箱效率提升+45%",
            players: [
                {id: "小狗羔羔", uid: "123336306", note:"",at: ""},
                {id: "Monoliu", uid: "478130231", note:"",at: ""},
                {id: "鲨鲨鲨鱼宝宝", uid: "293678411", note:"",at: ""},
            ]
        },
        {
            title: "鱼饵价格降低+15%",
            players: [
                 {id: "小蜜冯", uid: "55147823", note:"",at: ""},
                 {id: "半颜吖", uid: "978974992", note:"",at: ""},
                 {id: "豆哥子豆", uid: "522385819", note:"",at: ""},
                 {id: "⻄安", uid: "", note:"",at: "@高甜"},
                 {id: "07糕冷小妈", uid: "568607054", note:"",at: ""},
            ]
        },
        {
            title: "动物丰收概率提升 【大】",
            players: [
                {id: "麻雕先生", uid: "1820333179", note:"",at: ""},
                {id: "是小夭哇", uid: "1522764861", note:"",at: ""},
                {id: "观点星火", uid: "231457530", note:"",at: "@点听星火"},
            ]
        },{
            title: "每日拿取次数+15",
            players: [
                {id: "000", uid: "000", note:"",at: ""},
                {id: "000", uid: "000", note:"",at: ""},
            ]
        },
    ],

    // 耻辱柱数据
    shamePlayers: [
        {id: "待我腋毛齐腰", uid: ":117110522", note:"潜水、无贡献、无视群公告",at: ""},
        {id: "小梨宝baby", uid: ":5861737", note:"偷菜、炸鱼、乱祈福",at: ""},
        {id: "表情包的包", uid: "886993458", note:"偷菜、无贡献、潜水",at: ""},
        {id: "岛cpr", uid: "1314138596", note:"偷菜、无贡献、潜水",at: ""},
        {id: "易疯i", uid: "1346741598", note:"无贡献、无视群公告",at: ""}
    ]
}; 