// 玩家数据文件
const playerData = {
    // 玩家数据
    commonSection: [
        {
            title: "加工动物产品获得农场经验提升+24%",
            players: [
                {id: "夏日菠萝啤", uid: "735005786", note: "", at: "沾砚"},
                {id: "黒玫", uid: "461685749", note: "", at: ""},
                {id: "童趣夜末雪", uid: "385092742", note: "", at: "半颜吖"},
                {id: "Janelle芭啵", uid: "447189316", note: "", at: "鱼鱼崽崽z"},
                {id: "雾缕烟", uid: "296362325", note: "", at: "姈钰"},
                {id: "祈昭墨", uid: "1500829817", note: "", at: ""},

            ]
        }, {
            title: "加工器容量提升+40%",
            players: [
                {id: "沾砚", uid: "713365822", note: "", at: ""},
                {id: "泛清波摘遍", uid: "1986397236", note: "", at: ""},
                {id: "像素再见源泉", uid: "1185383571", note: "", at: ""},
                {id: "我要揪你耳朵咯", uid: "1977923052", note: "", at: "可可夹心芝士"},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
            ]
        },
        {
            title: "钓鱼&鱼卡熟练度+60%",
            players: [
                {id: "鲨鲨鲨鱼宝宝", uid: "293678411", note: "", at: ""},
                {id: "媃嬵", uid: "472562841", note: "", at: ""},
                {id: "Yao_冬", uid: "1672593855", note: "", at: ""},
                {id: "归眠恋玫瑰", uid: "724021019", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
            ]
        },
        {
            title: "农场丰收概率 【大】",
            players: [
                {id: "啊啊啊啊啊pan", uid: "1754205720", note: "", at: ""},
                {id: "青烟睡不醒", uid: "1723062653", note: "", at: "超级酷的知沂"},
                {id: "君禧绾之h", uid: "1063826097", note: "", at: ""},
                {id: "深情in棒棒糖", uid: "640491996", note: "", at: "半颜吖"},
                {id: "偷喝汽水ft", uid: "394458911", note: "", at: ""},
                {id: "点听星火", uid: "611352058", note: "", at: ""},
            ]
        }

    ],
    // 经验区数据
    experienceSection: [
        {
            title: "加工作物产品获得农场经验提升+30%",
            players: [
                {id: "奶优宝宝", uid: "1819681200", note: "", at: ""},
                {id: "酱酱不吃姜yu", uid: "1723090632", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
            ]
        },
        {
            title: "收获作物时农场经验获取提升+8%",
            players: [
                {id: "听点星火", uid: "4464407", note: "", at: "点听星火"},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
            ]
        },
        {
            title: "收获动物时农场经验获取提升+6%",
            players: [
                {id: "不知名媛酱", uid: "679423175", note: "", at: ""},
                {id: "柠檬爱汤圆", uid: "598717627", note: "", at: ""},
                {id: "美女不讲道理", uid: "185232831", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
            ]
        },
        {
            title: "鱼塘全水层钓鱼经验+15%",
            players: [
                {id: "深海", uid: "1360929314", note: "", at: ""},
                {id: "思相意", uid: "1589308148", note: "", at: "醉心妍"},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
            ]
        }
    ],

    // 熟练度区数据
    skillSection: [
        {
            title: "作物熟练度获取提升+40%",
            players: [
                {id: "喵喵喵哥哥怕怕", uid: "776027472", note: "", at: ""},
                {id: "萌小只", uid: "1773644104", note: "", at: "雪萌萌"},
                {id: "i乌龙茶", uid: "1247700275", note: "", at: "雪萌萌"},
                {id: "小狗羔羔", uid: "123336306", note: "", at: ""},
                {id: "me", uid: "185246080", note: "", at: ""},
                {id: "嘤嘤嘤猪酱", uid: "1746529615", note: "", at: ""},
                {id: "纱猫讥笑", uid: "1131453789", note: "", at: "6PJd"},
                {id: "清野睡不醒", uid: "1968007701", note: "", at: "超级酷的知沂"},
                {id: "小脑菜菜", uid: "982616931", note: "", at: ""},
                {id: "格子外的星空", uid: "1283643990", note: "", at: ""},
                {id: "吉士堡包", uid: "1917313311", note: "", at: ""},
            ]
        },
        {
            title: "动物熟练度获取提升+40%",
            players: [
                {id: "欧皇鸣鸣", uid: "956489658", note: "", at: ""},
                {id: "无糖瑶瑶", uid: "1880246729", note: "", at: "Yao_冬"},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
            ]
        }
    ],

    // 金币区数据
    coinSection: [

        {
            title: "水族箱效率提升+45%",
            players: [
                {id: "是谁在被爱", uid: "630029268", note: "", at: ""},
                {id: "打的你变猪头", uid: "1142182629", note: "", at: ""},
                {id: "星梦小小花花", uid: "1911186327", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
            ]
        },
        {
            title: "鱼饵价格降低+15%",
            players: [
                {id: "超级酷的知沂", uid: "1053835152", note: "", at: ""},
                {id: "睡不着的咪", uid: "1668523675", note: "", at: ""},
                {id: "柠萌不萌oO", uid: "1199132843", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
            ]
        },
        {
            title: "动物丰收概率提升 【大】",
            players: [
                {id: "是小夭哇", uid: "1522764861", note: "", at: ""},
                {id: "直觉委托喵咪", uid: "318064233", note: "", at: ""},
                {id: "花花仔1", uid: "791325551", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
            ]
        },{
            title: "每日拿取次数+15",
            players: [
                {id: "小雪LLL", uid: "1429665992", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
                {id: "000", uid: "000", note: "", at: ""},
            ]
        },
    ],

    // 耻辱柱数据
    shamePlayers: [
        {id: "待我腋毛齐腰", uid: "117110522", note: "潜水、无贡献、无视群公告", at: ""},
        {id: "小梨宝baby", uid: "5861737", note: "偷菜、炸鱼、乱祈福", at: ""},
        {id: "表情包的包", uid: "886993458", note: "偷菜、无贡献、潜水", at: ""},
        {id: "岛cpr", uid: "1314138596", note: "偷菜、无贡献、潜水", at: ""},
        {id: "易疯i", uid: "1346741598", note: "无贡献、无视群公告", at: ""}
    ]
}; 