// 扶贫用户数据
const povertyData = {
    // 扶贫用户列表
    povertyPlayers: [
        {
            id: "idobG",
            uid: "1977904409",
            note: "90-95级"
        },
        {
            id: "喜欢大地雷",
            uid: "1977904409",
            note: "90-95级"
        },
        {
            id: "小猫热不热",
            uid: "705735867",
            note: "神农莹草"
        },
        {
            id: "畅游堂o丽兰",
            uid: "449581048",
            note: "神农初心"
        },
        {
            id: "畅游堂o怪怪",
            uid: "558810672",
            note: "95-100级"
        },
        {
            id: "畅游堂o泡泡",
            uid: "1522225701",
            note: "95-100级"
        },
        {
            id: "畅游堂o青丝",
            uid: "435986494",
            note: "神农初心"
        },
        {
            id: "畅游堂o寻物",
            uid: "1258130132",
            note: "95-100级"
        },
        {
            id: "畅游堂o橘子",
            uid: "337082058",
            note: "95-100级"
        },
        {
            id: "畅游堂o可可",
            uid: "1551029511",
            note: "95-100级"
        },
    ],
    
    // 扶贫说明
    povertyInstructions: [
        "信息来源于网络，全网共享！",
        "需要请自己加，群内严禁讨论！",
        "群内发现关键词“畅游堂”直接杀！",
        "禁讨论关于下面的账号的任何内容！",
        "扶贫账号，任何东西随便拿，你不拿就是别人的！",
    ]
}; 